load-tests/k6-result-actividad5.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: create-order-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 30 looping VUs for 1m10s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m01.0s/1m10.0s

running (0m02.0s), 01/30 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 01/30 VUs  0m02.0s/1m10.0s

running (0m03.0s), 02/30 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 02/30 VUs  0m03.0s/1m10.0s

running (0m04.0s), 02/30 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 02/30 VUs  0m04.0s/1m10.0s

running (0m05.0s), 03/30 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 03/30 VUs  0m05.0s/1m10.0s

running (0m06.0s), 03/30 VUs, 9 complete and 0 interrupted iterations
default   [   9% ] 03/30 VUs  0m06.0s/1m10.0s

running (0m07.0s), 04/30 VUs, 12 complete and 0 interrupted iterations
default   [  10% ] 04/30 VUs  0m07.0s/1m10.0s

running (0m08.0s), 04/30 VUs, 16 complete and 0 interrupted iterations
default   [  11% ] 04/30 VUs  0m08.0s/1m10.0s

running (0m09.0s), 05/30 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 05/30 VUs  0m09.0s/1m10.0s

running (0m10.0s), 05/30 VUs, 23 complete and 0 interrupted iterations
default   [  14% ] 05/30 VUs  0m10.0s/1m10.0s

running (0m11.0s), 05/30 VUs, 28 complete and 0 interrupted iterations
default   [  16% ] 05/30 VUs  0m11.0s/1m10.0s

running (0m12.0s), 06/30 VUs, 33 complete and 0 interrupted iterations
default   [  17% ] 06/30 VUs  0m12.0s/1m10.0s

running (0m13.0s), 06/30 VUs, 39 complete and 0 interrupted iterations
default   [  19% ] 06/30 VUs  0m13.0s/1m10.0s

running (0m14.0s), 07/30 VUs, 45 complete and 0 interrupted iterations
default   [  20% ] 07/30 VUs  0m14.0s/1m10.0s

running (0m15.0s), 07/30 VUs, 52 complete and 0 interrupted iterations
default   [  21% ] 07/30 VUs  0m15.0s/1m10.0s

running (0m16.0s), 08/30 VUs, 59 complete and 0 interrupted iterations
default   [  23% ] 08/30 VUs  0m16.0s/1m10.0s

running (0m17.0s), 08/30 VUs, 67 complete and 0 interrupted iterations
default   [  24% ] 08/30 VUs  0m17.0s/1m10.0s

running (0m18.0s), 09/30 VUs, 75 complete and 0 interrupted iterations
default   [  26% ] 09/30 VUs  0m18.0s/1m10.0s

running (0m19.0s), 09/30 VUs, 84 complete and 0 interrupted iterations
default   [  27% ] 09/30 VUs  0m19.0s/1m10.0s

running (0m20.0s), 09/30 VUs, 93 complete and 0 interrupted iterations
default   [  29% ] 09/30 VUs  0m20.0s/1m10.0s

running (0m21.0s), 10/30 VUs, 102 complete and 0 interrupted iterations
default   [  30% ] 10/30 VUs  0m21.0s/1m10.0s

running (0m22.0s), 11/30 VUs, 112 complete and 0 interrupted iterations
default   [  31% ] 11/30 VUs  0m22.0s/1m10.0s

running (0m23.0s), 11/30 VUs, 123 complete and 0 interrupted iterations
default   [  33% ] 11/30 VUs  0m23.0s/1m10.0s

running (0m24.0s), 12/30 VUs, 134 complete and 0 interrupted iterations
default   [  34% ] 12/30 VUs  0m24.0s/1m10.0s

running (0m25.0s), 13/30 VUs, 146 complete and 0 interrupted iterations
default   [  36% ] 13/30 VUs  0m25.0s/1m10.0s

running (0m26.0s), 13/30 VUs, 159 complete and 0 interrupted iterations
default   [  37% ] 13/30 VUs  0m26.0s/1m10.0s

running (0m27.0s), 14/30 VUs, 172 complete and 0 interrupted iterations
default   [  39% ] 14/30 VUs  0m27.0s/1m10.0s

running (0m28.0s), 15/30 VUs, 186 complete and 0 interrupted iterations
default   [  40% ] 15/30 VUs  0m28.0s/1m10.0s

running (0m29.0s), 15/30 VUs, 201 complete and 0 interrupted iterations
default   [  41% ] 15/30 VUs  0m29.0s/1m10.0s

running (0m30.0s), 16/30 VUs, 216 complete and 0 interrupted iterations
default   [  43% ] 16/30 VUs  0m30.0s/1m10.0s

running (0m31.0s), 17/30 VUs, 232 complete and 0 interrupted iterations
default   [  44% ] 17/30 VUs  0m31.0s/1m10.0s

running (0m32.0s), 17/30 VUs, 249 complete and 0 interrupted iterations
default   [  46% ] 17/30 VUs  0m32.0s/1m10.0s

running (0m33.0s), 18/30 VUs, 266 complete and 0 interrupted iterations
default   [  47% ] 18/30 VUs  0m33.0s/1m10.0s

running (0m34.0s), 19/30 VUs, 284 complete and 0 interrupted iterations
default   [  49% ] 19/30 VUs  0m34.0s/1m10.0s

running (0m35.0s), 19/30 VUs, 303 complete and 0 interrupted iterations
default   [  50% ] 19/30 VUs  0m35.0s/1m10.0s

running (0m36.0s), 20/30 VUs, 322 complete and 0 interrupted iterations
default   [  51% ] 20/30 VUs  0m36.0s/1m10.0s

running (0m37.0s), 21/30 VUs, 342 complete and 0 interrupted iterations
default   [  53% ] 21/30 VUs  0m37.0s/1m10.0s

running (0m38.0s), 21/30 VUs, 363 complete and 0 interrupted iterations
default   [  54% ] 21/30 VUs  0m38.0s/1m10.0s

running (0m39.0s), 22/30 VUs, 384 complete and 0 interrupted iterations
default   [  56% ] 22/30 VUs  0m39.0s/1m10.0s

running (0m40.0s), 23/30 VUs, 406 complete and 0 interrupted iterations
default   [  57% ] 23/30 VUs  0m40.0s/1m10.0s

running (0m41.0s), 24/30 VUs, 431 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  0m41.0s/1m10.0s

running (0m42.0s), 24/30 VUs, 452 complete and 0 interrupted iterations
default   [  60% ] 24/30 VUs  0m42.0s/1m10.0s

running (0m43.0s), 25/30 VUs, 476 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  0m43.0s/1m10.0s

running (0m44.0s), 25/30 VUs, 501 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  0m44.0s/1m10.0s

running (0m45.0s), 26/30 VUs, 525 complete and 0 interrupted iterations
default   [  64% ] 26/30 VUs  0m45.0s/1m10.0s

running (0m46.4s), 27/30 VUs, 563 complete and 0 interrupted iterations
default   [  66% ] 27/30 VUs  0m46.4s/1m10.0s

running (0m47.0s), 27/30 VUs, 576 complete and 0 interrupted iterations
default   [  67% ] 27/30 VUs  0m47.0s/1m10.0s

running (0m48.0s), 28/30 VUs, 603 complete and 0 interrupted iterations
default   [  69% ] 28/30 VUs  0m48.0s/1m10.0s

running (0m49.0s), 29/30 VUs, 631 complete and 0 interrupted iterations
default   [  70% ] 29/30 VUs  0m49.0s/1m10.0s

running (0m50.0s), 29/30 VUs, 660 complete and 0 interrupted iterations
default   [  71% ] 29/30 VUs  0m50.0s/1m10.0s

running (0m51.0s), 30/30 VUs, 689 complete and 0 interrupted iterations
default   [  73% ] 30/30 VUs  0m51.0s/1m10.0s

running (0m52.0s), 28/30 VUs, 719 complete and 0 interrupted iterations
default   [  74% ] 28/30 VUs  0m52.0s/1m10.0s

running (0m53.0s), 27/30 VUs, 747 complete and 0 interrupted iterations
default   [  76% ] 27/30 VUs  0m53.0s/1m10.0s

running (0m54.0s), 25/30 VUs, 774 complete and 0 interrupted iterations
default   [  77% ] 25/30 VUs  0m54.0s/1m10.0s

running (0m55.0s), 24/30 VUs, 799 complete and 0 interrupted iterations
default   [  79% ] 24/30 VUs  0m55.0s/1m10.0s

running (0m56.0s), 22/30 VUs, 823 complete and 0 interrupted iterations
default   [  80% ] 22/30 VUs  0m56.0s/1m10.0s

running (0m57.0s), 20/30 VUs, 845 complete and 0 interrupted iterations
default   [  81% ] 20/30 VUs  0m57.0s/1m10.0s

running (0m58.0s), 19/30 VUs, 865 complete and 0 interrupted iterations
default   [  83% ] 19/30 VUs  0m58.0s/1m10.0s

running (0m59.0s), 18/30 VUs, 884 complete and 0 interrupted iterations
default   [  84% ] 18/30 VUs  0m59.0s/1m10.0s

running (1m00.0s), 16/30 VUs, 902 complete and 0 interrupted iterations
default   [  86% ] 16/30 VUs  1m00.0s/1m10.0s

running (1m01.0s), 14/30 VUs, 918 complete and 0 interrupted iterations
default   [  87% ] 14/30 VUs  1m01.0s/1m10.0s

running (1m02.0s), 13/30 VUs, 932 complete and 0 interrupted iterations
default   [  89% ] 13/30 VUs  1m02.0s/1m10.0s

running (1m03.0s), 11/30 VUs, 945 complete and 0 interrupted iterations
default   [  90% ] 11/30 VUs  1m03.0s/1m10.0s

running (1m04.0s), 10/30 VUs, 956 complete and 0 interrupted iterations
default   [  91% ] 10/30 VUs  1m04.0s/1m10.0s

running (1m05.0s), 08/30 VUs, 966 complete and 0 interrupted iterations
default   [  93% ] 08/30 VUs  1m05.0s/1m10.0s

running (1m06.0s), 07/30 VUs, 974 complete and 0 interrupted iterations
default   [  94% ] 07/30 VUs  1m06.0s/1m10.0s

running (1m07.0s), 05/30 VUs, 981 complete and 0 interrupted iterations
default   [  96% ] 05/30 VUs  1m07.0s/1m10.0s

running (1m08.0s), 04/30 VUs, 986 complete and 0 interrupted iterations
default   [  97% ] 04/30 VUs  1m08.0s/1m10.0s

running (1m09.0s), 02/30 VUs, 990 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  1m09.0s/1m10.0s

running (1m10.0s), 01/30 VUs, 992 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  1m10.0s/1m10.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=20.14ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1986    28.042162/s
    checks_succeeded...: 100.00% 1986 out of 1986
    checks_failed......: 0.00%   0 out of 1986

    ✓ created
    ✓ duration < 800ms

    HTTP
    http_req_duration..............: avg=9.22ms min=0s med=4.22ms max=268.71ms p(90)=10.75ms p(95)=20.14ms
      { expected_response:true }...: avg=9.22ms min=0s med=4.22ms max=268.71ms p(90)=10.75ms p(95)=20.14ms
    http_req_failed................: 0.00%  0 out of 993
    http_reqs......................: 993    14.021081/s

    EXECUTION
    iteration_duration.............: avg=1.01s  min=1s med=1s     max=1.64s    p(90)=1.01s   p(95)=1.04s  
    iterations.....................: 993    14.021081/s
    vus............................: 1      min=1        max=30
    vus_max........................: 30     min=30       max=30

    NETWORK
    data_received..................: 274 kB 3.9 kB/s
    data_sent......................: 166 kB 2.3 kB/s



running (1m10.8s), 00/30 VUs, 993 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  1m10s